<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/3_Windows_Functions/2_Aggregation.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Windows Functions Syntax

## Overview

**Marketing Analysis Focused**

### ü•Ö Analysis Goals

Explore user-level metrics to understand cohort size and the average lifetime value of users in each cohort.

- **Total Users by Cohort:** Get the total number of unique users in each cohort to get insight into the scale of each cohort. Helps evaluate the relative size of cohorts, which is essential for benchmarking revenue or engagement metrics.
- **Average LTV by Cohort:** Aggregates total revenue per user and calculates the average lifetime value for each cohort. Allows businesses to assess per-user contributions, critical for understanding the quality and long-term value of different cohorts.

### üìò Concepts Covered

- `COUNT()`
- `AVG()`

In [2]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the ipython-sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## COUNT

### üìù¬†Notes

- `COUNT()`: Counts the values, `DISTINCT` can be added to get the unique count.

```sql
  SELECT
    COUNT() OVER(
         PARTITION BY partition_expression
    ) AS window_column_alias
    FROM table_name
```

### üíª¬†Final Result

- Describe what the final result should be e.g. return the retention by X cohort.

#### Total Count of Customers by Cohort

**`COUNT()`, `OVER`, `PARTITION BY`**

1. Copy cohort_analysis CTE from before.

In [6]:
%%sql

SELECT 
    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
    customerkey
FROM sales
GROUP BY 
    customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey
0            2018      2044589
1            2021      1603477
2            2017       876049
3            2024      1469222
4            2018      2089398
...           ...          ...
49482        2019       853617
49483        2016      1573639
49484        2022      1355936
49485        2024       967453
49486        2022        34354

[49487 rows x 2 columns]

2. Put into a CTE.

In [7]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        customerkey
    FROM sales
    GROUP BY 
        customerkey
)

SELECT * 
FROM cohort_analysis

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey
0            2018      2044589
1            2021      1603477
2            2017       876049
3            2024      1469222
4            2018      2089398
...           ...          ...
49482        2019       853617
49483        2016      1573639
49484        2022      1355936
49485        2024       967453
49486        2022        34354

[49487 rows x 2 columns]

2. Get the total users by each cohort for each user id.

In [8]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        customerkey
    FROM sales
    GROUP BY 
        customerkey
)

SELECT 
    cohort_year,
    customerkey,
    COUNT(customerkey) OVER (PARTITION BY cohort_year) AS total_users
FROM cohort_analysis

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  total_users
0            2015      1088780         2825
1            2015      1404475         2825
2            2015       928010         2825
3            2015       492702         2825
4            2015       341576         2825
...           ...          ...          ...
49482        2024      1406861         1402
49483        2024       841578         1402
49484        2024       994228         1402
49485        2024      1032701         1402
49486        2024        47320         1402

[49487 rows x 3 columns]

---
## Average

### üìù¬†Notes

- `AVG()`: Calculates the average of the values

```sql
  SELECT
    COUNT() OVER(
         PARTITION BY partition_expression
    ) AS window_column_alias
    FROM table_name
```

### üíª¬†Final Result

- Text

**Note: Still need screenshot of the final result**.

#### Average Age by State

**`AVG()`, `OVER`, `PARTITION BY`**

1. Get the cohort_year and the total revenue for each user.

In [9]:
%%sql

SELECT 
    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
    customerkey,
    SUM(quantity * netprice * exchangerate) AS total_customer_net_revenue
FROM sales
GROUP BY 
    customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  total_customer_net_revenue
0            2018      2044589                     2470.73
1            2021      1603477                      136.62
2            2017       876049                     2601.13
3            2024      1469222                     5278.54
4            2018      2089398                       98.39
...           ...          ...                         ...
49482        2019       853617                      903.31
49483        2016      1573639                     6973.42
49484        2022      1355936                      149.99
49485        2024       967453                        5.40
49486        2022        34354                      828.80

[49487 rows x 3 columns]

2. Put into a CTE.

In [10]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        customerkey,
        SUM(quantity * netprice * exchangerate) AS total_customer_net_revenue
    FROM sales
    GROUP BY 
        customerkey
)

SELECT 
    *
FROM cohort_analysis

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  total_customer_net_revenue
0            2018      2044589                     2470.73
1            2021      1603477                      136.62
2            2017       876049                     2601.13
3            2024      1469222                     5278.54
4            2018      2089398                       98.39
...           ...          ...                         ...
49482        2019       853617                      903.31
49483        2016      1573639                     6973.42
49484        2022      1355936                      149.99
49485        2024       967453                        5.40
49486        2022        34354                      828.80

[49487 rows x 3 columns]

3. Get the avreage revenue by each user.

In [11]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        customerkey,
        SUM(quantity * netprice * exchangerate) AS total_customer_net_revenue
    FROM sales
    GROUP BY 
        customerkey
)

SELECT 
    cohort_year,
    customerkey,
    AVG(total_customer_net_revenue) OVER (PARTITION BY cohort_year) AS avg_total_customer_net_revenue
FROM cohort_analysis
ORDER BY 
    cohort_year,
    customerkey
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  avg_total_customer_net_revenue
0            2015         4376                         5271.59
1            2015         4403                         5271.59
2            2015         4925                         5271.59
3            2015         5729                         5271.59
4            2015         6048                         5271.59
...           ...          ...                             ...
49482        2024      2093965                         2037.55
49483        2024      2095129                         2037.55
49484        2024      2095691                         2037.55
49485        2024      2096470                         2037.55
49486        2024      2097541                         2037.55

[49487 rows x 3 columns]